Revit 2027 API
CableTray.RungSpace Property
 Distance between two rungs for the ladder cable tray.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double RungSpace { get; set; }
Public Property RungSpace As Double
	Get
	Set
public:
property double RungSpace {
	double get ();
	void set (double value);
}
member RungSpace : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The rung space value should be at least equal to or larger than rang width which is 1 inch.
See Also
Reference
CableTray Class
Autodesk.Revit.DB.Electrical Namespace